app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 4)
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 5)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`, `remember_token`) VALUES('hai', 'hai@gmail.com', '2015-08-13 05:23:57', '2015-08-13 05:23:57', '739b9d664d77db3ee3cab40737c6386fb7b6ef9e00b31a434fd7680e69482ba0', NULL, NULL)
---
  def create
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 25)
UPDATE `users` SET `encrypted_password` = 'ca978112ca1bbdcafac231b39a23dc4da786eff8147c4e72b9807785afee48bb', `updated_at` = '2015-08-13 09:08:42' WHERE `id` = 28
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy